{
  "header.projects": "Projects",
  "header.tech": "Technologies",
  "header.about": "About Me",
  "header.contact": "Contact",

  "hero.title": "Hi, I'm Aaron",
  "hero.subtitle": "Software Engineering student passionate about backend development. I am training in modern technologies to build robust, scalable, and high-impact systems.",

  "projects.title": "Projects",

  "projects.ezykey.title": "EzyKey Racoon - Fullstack",
  "projects.ezykey.desc": "I developed EzyKey, a complete e-commerce platform for selling software licenses, using a backend stack based on Node.js and Express.js to manage business logic, routing (including category pages, product details, and search), and interaction with a MySQL database. For the frontend, I implemented server-side rendering with EJS, creating dynamic views for the product catalog. The modern and fully responsive user interface was efficiently built with Tailwind CSS, incorporating elements like Glassmorphism.",

  "projects.nodeauth.title": "Node Auth - Authentication System with JWT and Cookies",
  "projects.nodeauth.desc": "Secure authentication system developed in Node.js. Implements user registration and login, session management with JWT stored in secure cookies, and password encryption with bcrypt. Includes dynamic views with EJS and styles with Bootstrap.",

  "projects.uploadimages.title": "PixelDrop - UploadImages",
  "projects.uploadimages.desc": "Full-stack web application for uploading, storing, and viewing images. Built with Node.js, Express, EJS, TailwindCSS, and MySQL. Allows drag-and-drop file upload, preview before uploading, storing in a database, and displaying them in a gallery with options to copy the link or download the image.",

  "projects.taskboard.title": "TaskBoard - Task Management",
  "projects.taskboard.desc": "Full-stack task management application developed with Node.js, Express, MySQL, EJS, and TailwindCSS under the MVC pattern. Allows creating, editing, and deleting tasks, with a minimalist interface.",

  "projects.portfolio.title": "Personal Portfolio - Aaron Sachun",
  "projects.portfolio.desc": "Personal portfolio designed and developed from scratch to showcase my projects, experience, and tech stack. Built with Tailwind CSS and responsive design best practices, integrating modern visual effects like glassmorphism, gradients, and animations.",

  "tech.title": "Technologies",
  "tech.subtitle": "On my journey as a developer, I have worked with a varied stack and different tools that enhance my workflow.",
  "tech.stack": "Stack",
  "tech.tools": "Tools",

  "about.title": "About Me",
  "about.text01": "I am a Software Engineering student focused on backend development, training in technologies such as Node.js, Express, and MySQL, complemented with frontend knowledge to build complete and functional applications.",
  "about.text02": "I stand out for effective communication and teamwork, skills I have strengthened by collaborating on university projects using agile management tools. I am passionate about creating technological solutions that are scalable, efficient, and high-impact, while continuously improving my technical and professional skills."
}
